# RefreshLB

## Description
Refreshes the contents of the specified list browser.

```pascal
FUNCTION RefreshLB(
				dialogID    : LONGINT;
				componentID : LONGINT): BOOLEAN;
```

```python
def vs.RefreshLB(dialogID, componentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern - Browser